an1r6dh/MINING/central_hub_esp32s3_5.ino
/**
 * ====================================================================================================
 * PROJECT: INTRINSICALLY SAFE REAL-TIME MINE SUBSIDENCE MONITORING & EARLY WARNING (SIH 26025)
 * FIRMWARE: ESP32-S3 Central Master Hub (central_hub_esp32s3_5.ino)
 * TARGET: ESP32-S3 Development Board (Arduino IDE Compilable)
 * ====================================================================================================
 * 
 * AUDIT CORRECTIONS IMPLEMENTED:
 * 1. Queue Initialization Race Fix (CRITICAL):
 *    - In setup(), gsmQueue = xQueueCreate(...) is now called BEFORE initHardware().
 *    - Prevents missed SMS alert requests if GPIO 10 transitions LOW during boot interrupt attach.
 * 2. 16x2 LCD Character Truncation Fix:
 *    - In updateLCDDisplay(), formatted line0 with %+04.1f:
 *      snprintf(line0, sizeof(line0), "N%d T:%+04.1f V:%.2f", ...)
 *    - Strictly formats to 16 characters ("N1 T:+0.0 V:0.00"), preventing 2nd decimal truncation.
 * 3. Explicit RF Wi-Fi Channel Lock:
 *    - Included <esp_wifi.h>.
 *    - esp_wifi_set_channel(ESPNOW_WIFI_CHANNEL, WIFI_SECOND_CHAN_NONE); locks RF hardware to Ch 1.
 * 4. FreeRTOS Dual-Core Architecture Retained:
 *    - Core 1: Non-blocking TDMA master beacon (1000ms), ESP-NOW telemetry processing, LCD & LEDs.
 *    - Core 0: vGsmSmsTask pinned via xTaskCreatePinnedToCore() for asynchronous SIM300L SMS alerts.
 * 5. Geotechnical Kalman State Isolation & Digital Override Retained:
 *    - Node 1: Processed through dedicated 1D Kalman filters (kfTilt, kfVibration, kfDisplacement).
 *    - Node 2: Direct digital override (bypasses Kalman filters for instantaneous alarm tripping).
 * ====================================================================================================
 */

#include <Arduino.h>
#include <esp_now.h>
#include <WiFi.h>
#include <esp_wifi.h> // Explicit Wi-Fi Hardware Channel Configuration
#include <Wire.h>
#include <LiquidCrystal_I2C.h>

/* ====================================================================================================
 * 1. HARDWARE PIN DEFINITIONS (ESP32-S3 SPECIFIC)
 * ==================================================================================================== */
#define PIN_LED_RED_POWER       1    // Power LED (Continuously driven HIGH in setup)
#define PIN_LED_GREEN_STATUS    2    // Status LED (Solid = Nodes 1 & 2 synced; Rapid blink = timeout)
#define PIN_BUZZER              4    // High-pitch alarm buzzer (Active buzzer or PWM drive)

#define PIN_SERVER_INTERRUPT    10   // AI Server Hardware Interrupt (Active LOW with internal pull-up)

#define PIN_GSM_RX              18   // ESP32-S3 RX1 -> connected to SIM300L TX
#define PIN_GSM_TX              17   // ESP32-S3 TX1 -> connected to SIM300L RX

#define PIN_I2C_SDA             8    // ESP32-S3 hardware I2C SDA
#define PIN_I2C_SCL             9    // ESP32-S3 hardware I2C SCL
#define LCD_I2C_ADDR            0x27 // Default PCF8574 backpack address (change to 0x3F if required)
#define LCD_COLS                16
#define LCD_ROWS                2

/* ====================================================================================================
 * 2. SYSTEM CONFIGURATION & SAFETY THRESHOLDS
 * ==================================================================================================== */
#define ESPNOW_WIFI_CHANNEL     1               // Channel for ESP-NOW TDMA cluster (RF Locked)
#define EMERGENCY_PHONE_NUMBER  "+919876543210" // Destination phone number for SMS alerts

#define CRITICAL_DISPLACEMENT_THRESH_MM 15.0f   // Critical rock mass displacement trigger (mm)
#define CRITICAL_TILT_THRESH_DEG        5.0f    // Critical angular tilt trigger (degrees)
#define NODE_TIMEOUT_MS                 3500    // Timeout threshold before marking a node offline

#define TDMA_FRAME_PERIOD_MS    1000            // Master TDMA superframe period (1000 ms)
#define TDMA_SLOT_DURATION_MS   80              // Transmit window duration per node (80 ms)
#define LCD_REFRESH_INTERVAL_MS 250             // Non-blocking LCD refresh interval
#define LCD_ROTATE_INTERVAL_MS  2000            // Rotate LCD telemetry between Node 1 & 2 every 2s
#define STATUS_BLINK_INTERVAL_MS 150            // Rapid blink rate when any demo node times out
#define SMS_COOLDOWN_MS         60000           // 60s cooldown between automated threshold SMS sends

/* ====================================================================================================
 * 3. EMBEDDED 1D DISCRETE KALMAN FILTER ENGINE
 * ==================================================================================================== */
class DiscreteKalmanFilter1D {
public:
    DiscreteKalmanFilter1D(float process_noise = 0.02f, float measurement_noise = 1.5f, float estimation_error = 1.0f, float initial_value = 0.0f)
        : _q(process_noise), _r(measurement_noise), _p(estimation_error), _x(initial_value), _k(0.0f) {}

    float update(float measurement) {
        _p = _p + _q;
        float denominator = _p + _r;
        _k = (fabs(denominator) > 1e-6f) ? (_p / denominator) : 0.5f;
        _x = _x + _k * (measurement - _x);
        _p = (1.0f - _k) * _p;
        return _x;
    }

    float getState() const { return _x; }
    void setNoiseParameters(float q, float r) { _q = q; _r = r; }

private:
    float _q;
    float _r;
    float _p;
    float _x;
    float _k;
};

/* ====================================================================================================
 * 4. PROTOCOL DATA STRUCTURES (EXACT PACKED BINARY PAYLOADS)
 * ==================================================================================================== */
#define PKT_TYPE_BEACON    0x01
#define PKT_TYPE_TELEMETRY 0x02

struct __attribute__((packed)) TDMABeaconPacket {
    uint8_t  msg_type;           // PKT_TYPE_BEACON
    uint32_t frame_id;          // Monotonically increasing frame counter
    uint32_t beacon_time_ms;    // Master clock timestamp
    uint16_t slot_duration_ms;  // Slot duration (80ms)
    uint8_t  total_slots;       // Number of active slots in frame
    uint8_t  emergency_flag;    // 1 if alarm active, 0 normal
};

struct __attribute__((packed)) SensorPayload {
    uint8_t  msg_type;          // PKT_TYPE_TELEMETRY
    uint8_t  node_id;           // 1 = Node 1, 2 = Node 2
    float    tilt;              // Raw Tilt angle (degrees)
    float    vibration;         // Raw Vibration acceleration (g or m/s^2)
    float    displacement;      // Raw Surface/Roof displacement (mm)
};

struct FilteredNodeRecord {
    bool     active;
    uint32_t last_packet_time;
    float    raw_tilt;
    float    raw_vibration;
    float    raw_displacement;
    float    filtered_tilt;
    float    filtered_vibration;
    float    filtered_displacement;
};

