an1r6dh/MINING/central_hub_esp32s3_5.ino
struct SmsAlertRequest {
    char message[140];
};

/* ====================================================================================================
 * 5. GLOBAL OBJECTS, FREERTOS HANDLES & PER-NODE KALMAN ARRAYS
 * ==================================================================================================== */
uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

HardwareSerial SerialGSM(1);
LiquidCrystal_I2C lcd(LCD_I2C_ADDR, LCD_COLS, LCD_ROWS);
bool lcdAvailable = false;

QueueHandle_t gsmQueue = NULL;

#define MAX_SUPPORTED_NODES 3 // Index 0 unused, Index 1 = Node 1, Index 2 = Node 2

// Dedicated 1D Kalman Filter instances for Node 1
DiscreteKalmanFilter1D kfTilt[MAX_SUPPORTED_NODES] = {
    DiscreteKalmanFilter1D(0.02f, 1.5f),
    DiscreteKalmanFilter1D(0.02f, 1.5f), // Node 1 Tilt
    DiscreteKalmanFilter1D(0.02f, 1.5f)  // Node 2 (Bypassed)
};

DiscreteKalmanFilter1D kfVibration[MAX_SUPPORTED_NODES] = {
    DiscreteKalmanFilter1D(0.05f, 2.0f),
    DiscreteKalmanFilter1D(0.05f, 2.0f), // Node 1 Vibration
    DiscreteKalmanFilter1D(0.05f, 2.0f)  // Node 2 (Bypassed)
};

DiscreteKalmanFilter1D kfDisplacement[MAX_SUPPORTED_NODES] = {
    DiscreteKalmanFilter1D(0.01f, 0.8f),
    DiscreteKalmanFilter1D(0.01f, 0.8f), // Node 1 Ultrasonic Displacement
    DiscreteKalmanFilter1D(0.01f, 0.8f)  // Node 2 (Bypassed)
};

FilteredNodeRecord nodes[MAX_SUPPORTED_NODES];

// System State & Non-Blocking Timers
uint32_t tdmaFrameId = 0;
uint32_t lastBeaconTxTime = 0;
uint32_t lastLcdUpdateTime = 0;
uint32_t lastLcdRotateTime = 0;
uint8_t  currentLcdDisplayNode = 1;
uint32_t lastBlinkTime = 0;
bool     greenLedState = false;
uint32_t lastAutoSmsDispatchTime = 0;

volatile bool serverInterruptTriggered = false;
bool smsAlertDispatchedForAi = false;
bool criticalAlarmActive = false;

/* ====================================================================================================
 * 6. FORWARD DECLARATIONS
 * ==================================================================================================== */
void vGsmSmsTask(void *pvParameters);
void sendSMSAlertBlocking(const char* alertMessage);
void triggerSmsAlert(const char* alertMsg);
void IRAM_ATTR handleServerInterruptISR();
void processIncomingData(const SensorPayload& payload);
void broadcastTDMABeacon();
void initHardware();
void initESPNowTDMA();
bool areAllDemoNodesSynced();
void updateStatusLEDs();
void handleBuzzerAlerts();
void lcdPrintPaddedLine(uint8_t row, const char* text);
void updateLCDDisplay();
void checkSerialCommands();

/* ====================================================================================================
 * 7. HARDWARE INTERRUPT SERVICE ROUTINE (ISR) FOR AI SERVER
 * ==================================================================================================== */
void IRAM_ATTR handleServerInterruptISR() {
    serverInterruptTriggered = true;
    if (gsmQueue != NULL) {
        SmsAlertRequest req;
        const char* msg = "EMERGENCY: AI Model predicts mine subsidence event! Evacuate Sector B!";
        strncpy(req.message, msg, sizeof(req.message) - 1);
        req.message[sizeof(req.message) - 1] = '\0';
        
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xQueueSendFromISR(gsmQueue, &req, &xHigherPriorityTaskWoken);
        if (xHigherPriorityTaskWoken) {
            portYIELD_FROM_ISR();
        }
    }
}

/* ====================================================================================================
 * 8. FREERTOS CORE 0 CELLULAR GSM TASK (NON-BLOCKING BACKGROUND DISPATCH)
 * ==================================================================================================== */
void vGsmSmsTask(void *pvParameters) {
    Serial.println("[FreeRTOS Core 0] GSM Background Task initialized.");
    SmsAlertRequest request;

    while (true) {
        if (xQueueReceive(gsmQueue, &request, portMAX_DELAY) == pdTRUE) {
            Serial.println("\n[FreeRTOS Core 0] ALERT IN QUEUE! Starting SMS dispatch...");
            sendSMSAlertBlocking(request.message);
            Serial.println("[FreeRTOS Core 0] SMS Dispatch complete. Returning to idle.\n");
        }
    }
}

void sendSMSAlertBlocking(const char* alertMessage) {
    while (SerialGSM.available()) SerialGSM.read();

    SerialGSM.println("AT+CMGF=1");
    vTaskDelay(pdMS_TO_TICKS(200));

    SerialGSM.print("AT+CMGS=\"");
    SerialGSM.print(EMERGENCY_PHONE_NUMBER);
    SerialGSM.println("\"");

    uint32_t promptTimeout = millis();
    bool promptReceived = false;
    while (millis() - promptTimeout < 5000) {
        if (SerialGSM.available()) {
            if (SerialGSM.read() == '>') {
                promptReceived = true;
                break;
            }
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    if (!promptReceived) {
        Serial.println("[GSM ERROR Core 0] Prompt '>' not received from SIM module!");
        return;
    }

    SerialGSM.print(alertMessage);
    vTaskDelay(pdMS_TO_TICKS(100));
    SerialGSM.write(0x1A); // Commit SMS with Ctrl+Z

    uint32_t sendTimeout = millis();
    bool sendSuccess = false;
    String gsmResponse = "";
    while (millis() - sendTimeout < 15000) {
        while (SerialGSM.available()) {
            char c = SerialGSM.read();
            gsmResponse += c;
        }
        if (gsmResponse.indexOf("OK") != -1 || gsmResponse.indexOf("+CMGS:") != -1) {
            sendSuccess = true;
            break;
        }
        if (gsmResponse.indexOf("ERROR") != -1) break;
        vTaskDelay(pdMS_TO_TICKS(50));
    }

    if (sendSuccess) {
        Serial.println("[GSM SUCCESS Core 0] Emergency SMS successfully delivered to cellular network!");
    } else {
        Serial.printf("[GSM ERROR Core 0] SMS transmission failed: %s\n", gsmResponse.c_str());
    }
}

void triggerSmsAlert(const char* alertMsg) {
    if (gsmQueue != NULL) {
        SmsAlertRequest req;
        strncpy(req.message, alertMsg, sizeof(req.message) - 1);
        req.message[sizeof(req.message) - 1] = '\0';
        xQueueSend(gsmQueue, &req, 0); // Non-blocking post from Core 1
    }
}

