an1r6dh/MINING/central_hub_esp32s3_5.ino
/* ====================================================================================================
 * 9. TELEMETRY PROCESSING: KALMAN FILTERING (NODE 1) & DIGITAL OVERRIDE (NODE 2)
 * ==================================================================================================== */
void processIncomingData(const SensorPayload& payload) {
    uint8_t id = payload.node_id;
    if (id == 0 || id >= MAX_SUPPORTED_NODES) return;

    nodes[id].active = true;
    nodes[id].last_packet_time = millis();
    nodes[id].raw_tilt = payload.tilt;
    nodes[id].raw_vibration = payload.vibration;
    nodes[id].raw_displacement = payload.displacement;

    if (id == 1) {
        nodes[1].filtered_tilt = kfTilt[1].update(payload.tilt);
        nodes[1].filtered_vibration = kfVibration[1].update(payload.vibration);
        nodes[1].filtered_displacement = kfDisplacement[1].update(payload.displacement);
    } 
    else if (id == 2) {
        nodes[2].filtered_tilt = payload.tilt;                 // 10.0f on trigger (breaches 5.0f limit instantly)
        nodes[2].filtered_vibration = payload.vibration;       // 1.0f on trigger
        nodes[2].filtered_displacement = payload.displacement; // 0.0f
    }
    else {
        nodes[id].filtered_tilt = kfTilt[id].update(payload.tilt);
        nodes[id].filtered_vibration = kfVibration[id].update(payload.vibration);
        nodes[id].filtered_displacement = kfDisplacement[id].update(payload.displacement);
    }

    Serial.printf("[NODE %d %s] Tilt: %+05.2f deg | Vib: %04.2f g | Disp: %05.1f mm\n",
                  id, (id == 2 ? "DIGITAL OVERRIDE" : "KALMAN FILTERED"),
                  nodes[id].filtered_tilt, nodes[id].filtered_vibration, nodes[id].filtered_displacement);

    if (nodes[id].filtered_displacement >= CRITICAL_DISPLACEMENT_THRESH_MM ||
        fabs(nodes[id].filtered_tilt) >= CRITICAL_TILT_THRESH_DEG) {
        criticalAlarmActive = true;
        Serial.printf("[LOCAL ALERT] Node %d breached safety limit! Tilt: %.1f deg, Disp: %.1f mm\n",
                      id, nodes[id].filtered_tilt, nodes[id].filtered_displacement);

        uint32_t now = millis();
        if (now - lastAutoSmsDispatchTime > SMS_COOLDOWN_MS) {
            lastAutoSmsDispatchTime = now;
            char autoAlert[140];
            snprintf(autoAlert, sizeof(autoAlert),
                     "CRITICAL ALERT: Mine Movement at Node %d! Tilt: %.1fdeg, Disp: %.1fmm.",
                     id, nodes[id].filtered_tilt, nodes[id].filtered_displacement);
            triggerSmsAlert(autoAlert);
        }
    } else {
        if (!serverInterruptTriggered) {
            bool anyNodeBreached = false;
            for (int i = 1; i < MAX_SUPPORTED_NODES; i++) {
                if (nodes[i].active &&
                    (nodes[i].filtered_displacement >= CRITICAL_DISPLACEMENT_THRESH_MM ||
                     fabs(nodes[i].filtered_tilt) >= CRITICAL_TILT_THRESH_DEG)) {
                    anyNodeBreached = true;
                    break;
                }
            }
            if (!anyNodeBreached) {
                criticalAlarmActive = false;
            }
        }
    }
}

/* ====================================================================================================
 * 10. ESP-NOW RECEPTION CALLBACK (CORE 1)
 * ==================================================================================================== */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void OnDataRecv(const esp_now_recv_info_t *recv_info, const uint8_t *incomingData, int len) {
#else
void OnDataRecv(const uint8_t *mac_addr, const uint8_t *incomingData, int len) {
#endif
    if (len == sizeof(SensorPayload)) {
        SensorPayload packet;
        memcpy(&packet, incomingData, sizeof(SensorPayload));
        if (packet.msg_type == PKT_TYPE_TELEMETRY) {
            processIncomingData(packet);
        }
    } else {
        Serial.printf("[ESP-NOW WARN] Unknown packet size: %d bytes\n", len);
    }
}

/* ====================================================================================================
 * 11. TDMA PROTOCOL IMPLEMENTATION (MASTER BEACON - CORE 1)
 * ==================================================================================================== */
void broadcastTDMABeacon() {
    TDMABeaconPacket beacon;
    beacon.msg_type = PKT_TYPE_BEACON;
    beacon.frame_id = ++tdmaFrameId;
    beacon.beacon_time_ms = millis();
    beacon.slot_duration_ms = TDMA_SLOT_DURATION_MS;
    beacon.total_slots = MAX_SUPPORTED_NODES;
    beacon.emergency_flag = (criticalAlarmActive || serverInterruptTriggered) ? 1 : 0;

    esp_err_t result = esp_now_send(broadcastAddress, (uint8_t *)&beacon, sizeof(beacon));
    if (result != ESP_OK) {
        Serial.printf("[TDMA] Beacon broadcast error: %d\n", result);
    }
}

/* ====================================================================================================
 * 12. HARDWARE & PERIPHERAL INITIALIZATION (CORE 1)
 * ==================================================================================================== */
void initHardware() {
    pinMode(PIN_LED_RED_POWER, OUTPUT);
    pinMode(PIN_LED_GREEN_STATUS, OUTPUT);
    digitalWrite(PIN_LED_RED_POWER, HIGH);  // RED LED set HIGH continuously to denote system power
    digitalWrite(PIN_LED_GREEN_STATUS, LOW);

    pinMode(PIN_BUZZER, OUTPUT);
    digitalWrite(PIN_BUZZER, LOW);

    pinMode(PIN_SERVER_INTERRUPT, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_SERVER_INTERRUPT), handleServerInterruptISR, FALLING);

    Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL);
    Wire.beginTransmission(LCD_I2C_ADDR);
    if (Wire.endTransmission() == 0) {
        lcdAvailable = true;
        lcd.init();
        lcd.backlight();
        lcd.clear();
        lcdPrintPaddedLine(0, "MINE SUBSIDENCE");
        lcdPrintPaddedLine(1, "HUB ON - TDMA CH1");
        Serial.println("[I2C] LCD 16x2 detected and ready.");
    } else {
        lcdAvailable = false;
        Serial.println("[I2C WARN] LCD 16x2 not detected on 0x27.");
    }

