an1r6dh/MINING/central_hub_esp32s3_5.ino
    SerialGSM.begin(9600, SERIAL_8N1, PIN_GSM_RX, PIN_GSM_TX);
    delay(1000);
    SerialGSM.println("AT");
    delay(200);
    SerialGSM.println("ATE0");
    delay(200);
    SerialGSM.println("AT+CMGF=1");
}

void initESPNowTDMA() {
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();

    // Explicitly lock physical Wi-Fi hardware to Channel 1
    esp_err_t chanErr = esp_wifi_set_channel(ESPNOW_WIFI_CHANNEL, WIFI_SECOND_CHAN_NONE);
    if (chanErr == ESP_OK) {
        Serial.printf("[RF LOCK] Wi-Fi Hardware locked to Channel %d\n", ESPNOW_WIFI_CHANNEL);
    } else {
        Serial.printf("[RF ERROR] Failed to lock Wi-Fi channel: %d\n", chanErr);
    }

    if (esp_now_init() != ESP_OK) {
        Serial.println("[ESP-NOW] Critical Init Failure!");
        if (lcdAvailable) {
            lcd.clear();
            lcdPrintPaddedLine(0, "ESP-NOW ERR!");
        }
        while (1) delay(1000);
    }

    esp_now_register_recv_cb(OnDataRecv);

    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, broadcastAddress, 6);
    peerInfo.channel = ESPNOW_WIFI_CHANNEL;
    peerInfo.encrypt = false;

    if (!esp_now_is_peer_exist(broadcastAddress)) {
        esp_now_add_peer(&peerInfo);
    }
}

/* ====================================================================================================
 * 13. UI & INDICATOR LOGIC (CORE 1) - ZERO-GHOSTING LCD PRINT ENGINE
 * ==================================================================================================== */

void lcdPrintPaddedLine(uint8_t row, const char* text) {
    if (!lcdAvailable) return;
    char buffer[17];
    snprintf(buffer, sizeof(buffer), "%-16.16s", text);
    lcd.setCursor(0, row);
    lcd.print(buffer);
}

bool areAllDemoNodesSynced() {
    uint32_t now = millis();
    bool node1Synced = nodes[1].active && (now - nodes[1].last_packet_time <= NODE_TIMEOUT_MS);
    bool node2Synced = nodes[2].active && (now - nodes[2].last_packet_time <= NODE_TIMEOUT_MS);

    if (!node1Synced) nodes[1].active = false;
    if (!node2Synced) nodes[2].active = false;

    return (node1Synced && node2Synced);
}

void updateStatusLEDs() {
    uint32_t now = millis();
    bool allSynced = areAllDemoNodesSynced();

    if (allSynced) {
        digitalWrite(PIN_LED_GREEN_STATUS, HIGH); // Solid ON when both nodes active & synced
    } else {
        if (now - lastBlinkTime >= STATUS_BLINK_INTERVAL_MS) {
            lastBlinkTime = now;
            greenLedState = !greenLedState;
            digitalWrite(PIN_LED_GREEN_STATUS, greenLedState ? HIGH : LOW);
        }
    }
}

void handleBuzzerAlerts() {
    if (criticalAlarmActive || serverInterruptTriggered) {
        uint32_t cycle = millis() % 400;
        digitalWrite(PIN_BUZZER, (cycle < 200) ? HIGH : LOW);
    } else {
        digitalWrite(PIN_BUZZER, LOW);
    }
}

void updateLCDDisplay() {
    if (!lcdAvailable) return;

    uint32_t now = millis();

    if (now - lastLcdRotateTime >= LCD_ROTATE_INTERVAL_MS) {
        lastLcdRotateTime = now;
        currentLcdDisplayNode = (currentLcdDisplayNode == 1) ? 2 : 1;
    }

    if (now - lastLcdUpdateTime < LCD_REFRESH_INTERVAL_MS) return;
    lastLcdUpdateTime = now;

    if (serverInterruptTriggered) {
        lcdPrintPaddedLine(0, "! AI PREDICTION !");
        lcdPrintPaddedLine(1, "EVACUATE MINE NOW");
        return;
    }

    if (criticalAlarmActive) {
        char critLine[17];
        snprintf(critLine, sizeof(critLine), "N%d T:%.0f D:%.0fmm", 
                 currentLcdDisplayNode, 
                 nodes[currentLcdDisplayNode].filtered_tilt, 
                 nodes[currentLcdDisplayNode].filtered_displacement);
        lcdPrintPaddedLine(0, "CRITICAL SUBSIDE");
        lcdPrintPaddedLine(1, critLine);
        return;
    }

    char line0[24];
    char line1[24];
    uint8_t n = currentLcdDisplayNode;

    if (nodes[n].active && (now - nodes[n].last_packet_time <= NODE_TIMEOUT_MS)) {
        // MANDATORY AUDIT FIX: Formatted with %+04.1f so line0 is strictly 16 chars ("N1 T:+0.0 V:0.00")
        // Eliminates second decimal truncation on Vibration reading!
        snprintf(line0, sizeof(line0), "N%d T:%+04.1f V:%.2f",
                 n, nodes[n].filtered_tilt, nodes[n].filtered_vibration);

        // Padded status indicator (%-5s) guarantees exact 16-character row
        const char* statusTag = (n == 2) ? "[DIG]" : "[OK] ";
        snprintf(line1, sizeof(line1), "D:%04.1fmm %-5s",
                 nodes[n].filtered_displacement, statusTag);
    } else {
        snprintf(line0, sizeof(line0), "NODE %d: TIMEOUT", n);
        snprintf(line1, sizeof(line1), "FRAME #%lu SYNC", tdmaFrameId);
    }

    lcdPrintPaddedLine(0, line0);
    lcdPrintPaddedLine(1, line1);
}

void checkSerialCommands() {
    if (Serial.available()) {
        String cmd = Serial.readStringUntil('\n');
        cmd.trim();
        if (cmd.startsWith("ALERT") || cmd.startsWith("INTERRUPT")) {
            Serial.printf("[AI COMMAND] Emergency alert: %s\n", cmd.c_str());
            serverInterruptTriggered = true;
            triggerSmsAlert("EMERGENCY: AI Model predicts mine subsidence event at Section B! Evacuate!");
        } else if (cmd.equalsIgnoreCase("RESET")) {
            serverInterruptTriggered = false;
            criticalAlarmActive = false;
            smsAlertDispatchedForAi = false;
            digitalWrite(PIN_BUZZER, LOW);
            Serial.println("[SYSTEM] System reset to safe.");
        }
    }
}

/* ====================================================================================================
 * 14. ARDUINO SETUP (CORE 1 WIRELESS + CORE 0 FREERTOS TASK SPAWN)
 * ==================================================================================================== */
void setup() {
    Serial.begin(115200);
    delay(1000);
    Serial.println("\n[SYSTEM] ESP32-S3 Central Master Hub (central_hub_esp32s3_5) Booting...");

    // MANDATORY AUDIT FIX: 1. Create FreeRTOS Queue BEFORE attaching interrupts in initHardware()
    // Prevents missed SMS alerts if GPIO 10 transitions LOW during bootup
    gsmQueue = xQueueCreate(5, sizeof(SmsAlertRequest));
    if (gsmQueue != NULL) {
        Serial.println("[FreeRTOS] GSM Message Queue created.");
    }

    // 2. Initialize Hardware & Interrupts safely with valid queue
    initHardware();
    initESPNowTDMA();

    // 3. Spawn dedicated GSM SMS worker task PINNED TO CORE 0
    xTaskCreatePinnedToCore(
        vGsmSmsTask,        // Function
        "vGsmSmsTask",      // Name
        4096,               // Stack size
        NULL,               // Parameter
        1,                  // Priority
        NULL,               // Task handle
        0                   // CORE 0 PINNING
    );

    Serial.printf("[READY] Real-Time Wireless TDMA running on Core %d.\n", xPortGetCoreID());
}

/* ====================================================================================================
 * 15. MAIN LOOP (CORE 1 - ZERO LATENCY DURING SMS DISPATCH)
 * ==================================================================================================== */
void loop() {
    uint32_t currentMillis = millis();

    if (currentMillis - lastBeaconTxTime >= TDMA_FRAME_PERIOD_MS) {
        lastBeaconTxTime = currentMillis;
        broadcastTDMABeacon();
    }

    checkSerialCommands();
    updateStatusLEDs();
    handleBuzzerAlerts();
    updateLCDDisplay();
}
